mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/mb9bf36xm/common/mb9bf36xm.h
#define bFM_ADC1_SCIS23_AN16                      *((volatile  uint8_t *)(0x424E2200UL))
#define bFM4_ADC1_SCIS23_AN16                     *((volatile  uint8_t *)(0x424E2200UL))
#define bFM_ADC1_SCIS23_AN17                      *((volatile  uint8_t *)(0x424E2204UL))
#define bFM4_ADC1_SCIS23_AN17                     *((volatile  uint8_t *)(0x424E2204UL))
#define bFM_ADC1_SCIS23_AN18                      *((volatile  uint8_t *)(0x424E2208UL))
#define bFM4_ADC1_SCIS23_AN18                     *((volatile  uint8_t *)(0x424E2208UL))
#define bFM_ADC1_SCIS23_AN19                      *((volatile  uint8_t *)(0x424E220CUL))
#define bFM4_ADC1_SCIS23_AN19                     *((volatile  uint8_t *)(0x424E220CUL))
#define bFM_ADC1_SCIS23_AN20                      *((volatile  uint8_t *)(0x424E2210UL))
#define bFM4_ADC1_SCIS23_AN20                     *((volatile  uint8_t *)(0x424E2210UL))
#define bFM_ADC1_SCIS23_AN21                      *((volatile  uint8_t *)(0x424E2214UL))
#define bFM4_ADC1_SCIS23_AN21                     *((volatile  uint8_t *)(0x424E2214UL))
#define bFM_ADC1_SCIS23_AN22                      *((volatile  uint8_t *)(0x424E2218UL))
#define bFM4_ADC1_SCIS23_AN22                     *((volatile  uint8_t *)(0x424E2218UL))
#define bFM_ADC1_SCIS23_AN23                      *((volatile  uint8_t *)(0x424E221CUL))
#define bFM4_ADC1_SCIS23_AN23                     *((volatile  uint8_t *)(0x424E221CUL))
#define bFM_ADC1_SCIS23_AN24                      *((volatile  uint8_t *)(0x424E2220UL))
#define bFM4_ADC1_SCIS23_AN24                     *((volatile  uint8_t *)(0x424E2220UL))
#define bFM_ADC1_SCIS23_AN25                      *((volatile  uint8_t *)(0x424E2224UL))
#define bFM4_ADC1_SCIS23_AN25                     *((volatile  uint8_t *)(0x424E2224UL))
#define bFM_ADC1_SCIS23_AN26                      *((volatile  uint8_t *)(0x424E2228UL))
#define bFM4_ADC1_SCIS23_AN26                     *((volatile  uint8_t *)(0x424E2228UL))
#define bFM_ADC1_SCIS23_AN27                      *((volatile  uint8_t *)(0x424E222CUL))
#define bFM4_ADC1_SCIS23_AN27                     *((volatile  uint8_t *)(0x424E222CUL))
#define bFM_ADC1_SCIS23_AN28                      *((volatile  uint8_t *)(0x424E2230UL))
#define bFM4_ADC1_SCIS23_AN28                     *((volatile  uint8_t *)(0x424E2230UL))
#define bFM_ADC1_SCIS23_AN29                      *((volatile  uint8_t *)(0x424E2234UL))
#define bFM4_ADC1_SCIS23_AN29                     *((volatile  uint8_t *)(0x424E2234UL))
#define bFM_ADC1_SCIS23_AN30                      *((volatile  uint8_t *)(0x424E2238UL))
#define bFM4_ADC1_SCIS23_AN30                     *((volatile  uint8_t *)(0x424E2238UL))
#define bFM_ADC1_SCIS23_AN31                      *((volatile  uint8_t *)(0x424E223CUL))
#define bFM4_ADC1_SCIS23_AN31                     *((volatile  uint8_t *)(0x424E223CUL))

#define bFM_ADC1_WCMPCR_RCOE                      *((volatile  uint8_t *)(0x424E2988UL))
#define bFM4_ADC1_WCMPCR_RCOE                     *((volatile  uint8_t *)(0x424E2988UL))
#define bFM_ADC1_WCMPCR_RCOIE                     *((volatile  uint8_t *)(0x424E298CUL))
#define bFM4_ADC1_WCMPCR_RCOIE                    *((volatile  uint8_t *)(0x424E298CUL))
#define bFM_ADC1_WCMPCR_RCOIRS                    *((volatile  uint8_t *)(0x424E2990UL))
#define bFM4_ADC1_WCMPCR_RCOIRS                   *((volatile  uint8_t *)(0x424E2990UL))

#define bFM_ADC1_WCMPSR_WCMD                      *((volatile  uint8_t *)(0x424E29B4UL))
#define bFM4_ADC1_WCMPSR_WCMD                     *((volatile  uint8_t *)(0x424E29B4UL))

#define bFM_ADC1_WCMRCIF_RCINT                    *((volatile  uint8_t *)(0x424E2900UL))
#define bFM4_ADC1_WCMRCIF_RCINT                   *((volatile  uint8_t *)(0x424E2900UL))

#define bFM_ADC1_WCMRCOT_RCOOF                    *((volatile  uint8_t *)(0x424E2880UL))
#define bFM4_ADC1_WCMRCOT_RCOOF                   *((volatile  uint8_t *)(0x424E2880UL))


/*******************************************************************************
* ADC Registers ADC2
*   Bitband Section
*******************************************************************************/
#define bFM_ADC2_ADCEN_ENBL                       *((volatile  uint8_t *)(0x424E4780UL))
#define bFM4_ADC2_ADCEN_ENBL                      *((volatile  uint8_t *)(0x424E4780UL))
#define bFM_ADC2_ADCEN_READY                      *((volatile  uint8_t *)(0x424E4784UL))
#define bFM4_ADC2_ADCEN_READY                     *((volatile  uint8_t *)(0x424E4784UL))

#define bFM_ADC2_ADCR_OVRIE                       *((volatile  uint8_t *)(0x424E4020UL))
#define bFM4_ADC2_ADCR_OVRIE                      *((volatile  uint8_t *)(0x424E4020UL))
#define bFM_ADC2_ADCR_CMPIE                       *((volatile  uint8_t *)(0x424E4024UL))
#define bFM4_ADC2_ADCR_CMPIE                      *((volatile  uint8_t *)(0x424E4024UL))
#define bFM_ADC2_ADCR_PCIE                        *((volatile  uint8_t *)(0x424E4028UL))
#define bFM4_ADC2_ADCR_PCIE                       *((volatile  uint8_t *)(0x424E4028UL))
#define bFM_ADC2_ADCR_SCIE                        *((volatile  uint8_t *)(0x424E402CUL))
#define bFM4_ADC2_ADCR_SCIE                       *((volatile  uint8_t *)(0x424E402CUL))
#define bFM_ADC2_ADCR_CMPIF                       *((volatile  uint8_t *)(0x424E4034UL))
#define bFM4_ADC2_ADCR_CMPIF                      *((volatile  uint8_t *)(0x424E4034UL))
#define bFM_ADC2_ADCR_PCIF                        *((volatile  uint8_t *)(0x424E4038UL))
#define bFM4_ADC2_ADCR_PCIF                       *((volatile  uint8_t *)(0x424E4038UL))
#define bFM_ADC2_ADCR_SCIF                        *((volatile  uint8_t *)(0x424E403CUL))
#define bFM4_ADC2_ADCR_SCIF                       *((volatile  uint8_t *)(0x424E403CUL))

#define bFM_ADC2_ADSR_SCS                         *((volatile  uint8_t *)(0x424E4000UL))
#define bFM4_ADC2_ADSR_SCS                        *((volatile  uint8_t *)(0x424E4000UL))
#define bFM_ADC2_ADSR_PCS                         *((volatile  uint8_t *)(0x424E4004UL))
#define bFM4_ADC2_ADSR_PCS                        *((volatile  uint8_t *)(0x424E4004UL))
#define bFM_ADC2_ADSR_PCNS                        *((volatile  uint8_t *)(0x424E4008UL))
#define bFM4_ADC2_ADSR_PCNS                       *((volatile  uint8_t *)(0x424E4008UL))
#define bFM_ADC2_ADSR_FDAS                        *((volatile  uint8_t *)(0x424E4018UL))
#define bFM4_ADC2_ADSR_FDAS                       *((volatile  uint8_t *)(0x424E4018UL))
#define bFM_ADC2_ADSR_ADSTP                       *((volatile  uint8_t *)(0x424E401CUL))
#define bFM4_ADC2_ADSR_ADSTP                      *((volatile  uint8_t *)(0x424E401CUL))

